Autodesk.Revit.DB.ExtrusionAnalyzer.CalculateFaceAlignment
Calculates the alignment status of each face of the solid.
Remarks:
You can obtain the element which produced the non-aligned face by passing
the face to Element.GetGeneratingElementIds().
Returns:
Maps each face of the solid to its alignment status.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer.GetExtrusionBase
Obtains the face that represents the base contour of the extrusion analysis.
Returns:
The face that represents the base contour.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer.Create(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.XYZ)
Creates an ExtrusionAnalyzer and computes and stores the solid's shadow.
solidGeometry:
The geometry to analyze.
plane:
The plane to use for the base plane for the extrusion.
direction:
The direction to use for the calculation for the extrusion.
The direction must be transverse to the base plane.
Returns:
The newly created ExtrusionAnalyzer object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input direction must be transverse to the input plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A failure occurred in creating the ExtrusionAnalyzer or computing the solid's shadow.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExtrusionAnalyzer.EndParameter
The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer.StartParameter
The start parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer.ExtrusionDirection
The direction of extrusion specified for the extrusion analysis.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer
This geometry utility allows you to attempt to "fit" a given piece of geometry into
the shape of an extrusion.
Remarks:
An instance of this class is a single-time use class which should be supplied a
solid geometry, a plane, and a direction.  The utility will calculate a base boundary
parallel to the input plane which is the outer boundary of the shadow cast by the
solid onto the input plane and along the extrusion direction.
After the extrusion has been calculated, the class permits a second step
analysis to identify all faces from the original geometry which do not align with the
faces of the calculated extrusion.
This utility works best for geometry which are at least somewhat "extrusion-like",
for example, the geometry of a wall which may or may not be affected by end joins,
floor joins, roof joins, openings cut by windows and doors, or other
modifications.
Since:
2012